CSI API ETABS v1
cLineElm.GetLoadPoint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadPoint(
	string Name,
	ref int NumberItems,
	ref string[] LineName,
	ref string[] LoadPat,
	ref int[] MyType,
	ref string[] CSys,
	ref int[] Dir,
	ref double[] RelDist,
	ref double[] Dist,
	ref double[] Val,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadPoint (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef LineName As String(),
	ByRef LoadPat As String(),
	ByRef MyType As Integer(),
	ByRef CSys As String(),
	ByRef Dir As Integer(),
	ByRef RelDist As Double(),
	ByRef Dist As Double(),
	ByRef Val As Double(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim NumberItems As Integer
Dim LineName As String()
Dim LoadPat As String()
Dim MyType As Integer()
Dim CSys As String()
Dim Dir As Integer()
Dim RelDist As Double()
Dim Dist As Double()
Dim Val As Double()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadPoint(Name,
	NumberItems, LineName, LoadPat, MyType,
	CSys, Dir, RelDist, Dist, Val, ItemTypeElm)
int GetLoadPoint(
	String^ Name,
	int% NumberItems,
	array<String^>^% LineName,
	array<String^>^% LoadPat,
	array<int>^% MyType,
	array<String^>^% CSys,
	array<int>^% Dir,
	array<double>^% RelDist,
	array<double>^% Dist,
	array<double>^% Val,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadPoint :
        Name : string *
        NumberItems : int byref *
        LineName : string[] byref *
        LoadPat : string[] byref *
        MyType : int[] byref *
        CSys : string[] byref *
        Dir : int[] byref *
        RelDist : float[] byref *
        Dist : float[] byref *
        Val : float[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
LineName
Type: System.String[]
LoadPat
Type: System.String[]
MyType
Type: System.Int32[]
CSys
Type: System.String[]
Dir
Type: System.Int32[]
RelDist
Type: System.Double[]
Dist
Type: System.Double[]
Val
Type: System.Double[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace